var dataMap = {};

var GDP = [ '阿拉善盟', '乌海市', '巴彦淖尔市', '包头市', '鄂尔多斯市', '呼和浩特市', '乌兰察布市', '锡林郭勒盟', '赤峰市', '通辽市', '兴安盟', '呼伦贝尔市' ];
var power = [ '火电', '风电', '其它' ];
var poll = [ 'SO2', 'NOx', '烟尘' ]
var com = [ '内蒙', '全国' ];
function dataFormatter(obj, values) {
	var temp;
	var max = 0;
	for ( var year = 2011; year <= 2015; year++) {
		temp = obj[year];
		for ( var i = 0, l = temp.length; i < l; i++) {
			max = Math.max(max, temp[i]);
			obj[year][i] = {
				name : values[i],
				value : temp[i]
			}
		}
		obj[year + 'max'] = Math.floor(max / 100) * 100;
	}
	return obj;
}

function dataMix(list) {
	var mixData = {};
	for ( var i = 0, l = list.length; i < l; i++) {
		for ( var key in list[i]) {
			if (list[i][key] instanceof Array) {
				mixData[key] = mixData[key] || [];
				for ( var j = 0, k = list[i][key].length; j < k; j++) {
					mixData[key][j] = mixData[key][j] || {
						name : list[i][key][j].name,
						value : []
					};
					mixData[key][j].value.push(list[i][key][j].value);
				}
			}
		}
	}
	return mixData;
}

dataMap.dataGDP = dataFormatter( {
	//max : 60000,
	2015 : [ 50, 70, 99, 102, 53, 85, 42, 34, 35, 76, 105, 122 ],
	2014 : [ 23, 88, 42, 106, 408, 59, 203, 105, 105, 105, 40, 300 ],
	2013 : [ 28, 102, 40, 155, 152, 156, 201, 50, 12, 65, 201, 153 ],
	2012 : [ 75, 24, 201, 45, 51, 78, 12, 50, 203, 263, 102, 130 ],
	2011 : [ 103, 105, 301, 50, 102, 105, 123, 152, 162, 152, 175, 185 ]
}, GDP);

dataMap.dataInstalled = [ [] ];

dataMap.dataPower = [ [] ];

dataMap.dataPowerCom = [ [] ];
dataMap.dataInstalledCom = [ [] ];
dataMap.dataEffectiveCom = [ [] ];

/**
 * 电网 地理信息
 * @type {{神华宝日希勒能源有限公司二电厂: number[], 内蒙古大雁矿业集团有限责任公司雁南热电厂: number[], 呼伦贝尔安泰热电有限责任公司东海拉尔发电厂: number[], 呼伦贝尔安泰热电有限公司牙克石热电厂: number[], 呼伦贝尔安泰热电有限责任公司灵泉电厂: number[], 呼伦贝尔安泰热电有限公司汇流河发电厂: number[], 呼伦贝尔安泰热电股份有限公司扎兰屯热电厂: number[], 呼伦贝尔安泰热电有限责任公司海拉尔热电厂: number[], 呼伦贝尔安泰热电有限责任公司满洲里热电厂: number[], 扎赉诺尔煤业有限责任公司煤矸石热电厂: number[], 华能伊敏煤电有限责任公司海拉尔热电厂: number[], 内蒙古蒙东能源有限公司鄂温克发电厂: number[], 内蒙古大雁矿业集团有限责任公司雁中热电厂: number[], 大雁煤业有限责任公司热电总厂雁北热电厂: number[], 神华宝日希勒能源有限公司一电厂: number[], 北方联合电力有限责任公司乌拉特发电厂: number[], 北方联合电力有限责任公司临河热电厂: number[], 内蒙古蒙电华能热电股份有限公司丰镇发电厂: number[], 蒙维科技自备电厂: number[], 乌兰察布市宏大实业有限公司兴和热电厂: number[], 内蒙古国电能源投资有限公司锡林热电厂: number[], 锡林浩特第二发电厂: number[], 内蒙古能源发电投资集团有限公司乌斯太热电厂: number[]}}
 */
var powerPos = {
	'神华宝日希勒能源有限公司二电厂' : [ 119.793528, 49.356111 ],
	'内蒙古大雁矿业集团有限责任公司雁南热电厂' : [ 120.4, 49.15 ],
	'呼伦贝尔安泰热电有限责任公司东海拉尔发电厂' : [ 119.829722, 49.260556 ],
	'呼伦贝尔安泰热电有限公司牙克石热电厂' : [ 120.729167, 49.292778 ],
	'呼伦贝尔安泰热电有限责任公司灵泉电厂' : [ 117.676667, 49.397222 ],
	'呼伦贝尔安泰热电有限公司汇流河发电厂' : [ 120.848611, 49.296667 ],
	'呼伦贝尔安泰热电股份有限公司扎兰屯热电厂' : [ 122.750278, 48.001944 ],
	'呼伦贝尔安泰热电有限责任公司海拉尔热电厂' : [ 119.733333, 49.233333 ],
	'呼伦贝尔安泰热电有限责任公司满洲里热电厂' : [ 117.480833, 49.586389 ],
	'扎赉诺尔煤业有限责任公司煤矸石热电厂' : [ 117.696111, 49.483333 ],
	'华能伊敏煤电有限责任公司海拉尔热电厂' : [ 119.979444, 49.242222 ],
	'内蒙古蒙东能源有限公司鄂温克发电厂' : [ 119.916667, 48.783333 ],
	'内蒙古大雁矿业集团有限责任公司雁中热电厂' : [ 120.4, 49.15 ],
	'大雁煤业有限责任公司热电总厂雁北热电厂' : [ 120.4, 49.166667 ],
	'神华宝日希勒能源有限公司一电厂' : [ 119.793333, 49.356111 ],
	'北方联合电力有限责任公司乌拉特发电厂' : [ 108.7675, 40.651111 ],
	'北方联合电力有限责任公司临河热电厂' : [ 107.583333, 40.135278 ],
	'内蒙古蒙电华能热电股份有限公司丰镇发电厂' : [ 113.083333, 40.4 ],
	'蒙维科技自备电厂' : [ 113, 40 ],
	'乌兰察布市宏大实业有限公司兴和热电厂' : [ 113.7475, 40.863889 ],
	'内蒙古国电能源投资有限公司锡林热电厂' : [ 116.136111, 43.986944 ],
	'锡林浩特第二发电厂' : [ 115.5033333, 42.725 ],
	'内蒙古能源发电投资集团有限公司乌斯太热电厂' : [ 106.6744443, 39.445278 ]
}

/**
 * 煤炭地理信息
 * @type {{华能伊敏煤电有限责任公司: number[], 扎赉诺尔煤业有限责任公司煤矸石热电厂: number[], 华能伊敏煤电有限责任公司海拉尔热电厂: number[], 内蒙古牙克石五九煤炭（集团）有限责任公司: number[], 扎赉诺尔煤业有限责任公司: number[], 内蒙古大雁矿业集团有限责任公司雁南煤矿: number[], 大雁煤业有限责任公司热电总厂雁北热电厂: number[], 内蒙古磴口金牛煤电有限公司: number[], 大唐内蒙古多伦煤化工有限责任公司: number[], 内蒙古平西白音华煤业有限公司: number[], 内蒙古庆华集团庆华煤化有限责任公司: number[], 内蒙古太西煤集团兴泰煤化有限责任公司: number[], 内蒙古庆华集团庆华煤化有限责任公司污水处理厂: number[], 内蒙古庆华集团腾格里煤化有限公司: number[]}}
 */
dataMap.coalPos = {
	'华能伊敏煤电有限责任公司' : [ 119.833333, 48.833333 ],
	'扎赉诺尔煤业有限责任公司煤矸石热电厂' : [ 117.696111, 49.483333 ],
	'华能伊敏煤电有限责任公司海拉尔热电厂' : [ 119.979444, 49.242222 ],
	'内蒙古牙克石五九煤炭（集团）有限责任公司' : [ 121.46, 49.501389 ],
	'扎赉诺尔煤业有限责任公司' : [ 117.696111, 49.483333 ],
	'内蒙古大雁矿业集团有限责任公司雁南煤矿' : [ 120.4, 49.15 ],
	'大雁煤业有限责任公司热电总厂雁北热电厂' : [ 120.4, 49.166667 ],
	'内蒙古磴口金牛煤电有限公司' : [ 107.003889, 40.383611 ],
	'大唐内蒙古多伦煤化工有限责任公司' : [ 116.577778, 42.195833 ],
	'内蒙古平西白音华煤业有限公司' : [ 118.420833, 42.195833 ],
	'内蒙古庆华集团庆华煤化有限责任公司' : [ 106.722222, 39.535 ],
	'内蒙古太西煤集团兴泰煤化有限责任公司' : [ 106.061111, 39.085 ],
	'内蒙古庆华集团庆华煤化有限责任公司污水处理厂' : [ 106.716667, 39.533333 ],
	'内蒙古庆华集团腾格里煤化有限公司' : [ 105.189722, 38.509722 ]
}

/**
 * 网络地理信息
 * @type {{电1: number[], 电2: number[], 电3: number[], 电4: number[], 电5: number[], 电6: number[], 电7: number[], 电8: number[], 电9: number[], 电10: number[], 电11: number[], 电12: number[], 电13: number[], 电14: number[], 电15: number[], 电16: number[], 电17: number[], 电18: number[], 电19: number[]}}
 */
dataMap.netWorkPos = {
	'电1' : [ 118.74, 49.16 ],
	'电2' : [ 122.06, 50.37 ],
	'电3' : [ 121.35, 48.64 ],
	'电4' : [ 121.43, 47.81 ],
	'电5' : [ 120.20, 46.90 ],
	'电6' : [ 122.69, 46.37 ],
	'电7' : [ 119.90, 44.57 ],
	'电8' : [ 116.23, 45.05 ],
	'电9' : [ 115.99, 43.88 ],
	'电10' : [ 122.11, 43.35 ],
	'电11' : [ 116.72, 43.20 ],
	'电12' : [ 112.20, 42.89 ],
	'电13' : [ 111.59, 41.01 ],
	'电14' : [ 108.09, 41.69 ],
	'电15' : [ 108.88, 39.84 ],
	'电16' : [ 104.53, 40.68 ],
	'电17' : [ 101.56, 40.36 ],
	'电18' : [ 100.62, 41.61 ],
	'电19' : [ 99.10, 41.93 ]
}

/**
 * 湖地理信息
 * @type {{p1: number[], p1: number[], p1: number[], p1: number[], p1: number[]}}
 */
dataMap.lakePos = {
	'p1' : [ 117.60, 49.27 ],
	'p2' : [ 117.70, 49.15 ],
	'p3' : [ 117.79, 49.09 ],
	'p4' : [ 117.31, 48.60 ],
	'p5' : [ 117.91, 48.79 ]
}

/**
 *
 * @type {{}}
 */
dataMap.eRiverPos = {
	'额1' : [ 121.45, 50.32 ],
	'额2' : [ 120.91, 53.29 ],
	'额3' : [ 120.52, 53.04 ],
	'额4' : [ 120.03, 52.78 ],
	'额5' : [ 120.19, 52.60 ],
	'额6' : [ 120.80, 52.55 ],
	'额7' : [ 120.72, 52.05 ],
	'额8' : [ 120.31, 51.76 ],
	'额9' : [ 119.73, 51.05 ],
	'额10' : [ 119.20, 50.39 ],
	'额11' : [ 119.35, 50.26 ],
	'额12' : [ 119.09, 49.99 ],
	'额13' : [ 118.44, 45.27 ]
}
